In [16]:
import pandas as pd
import numpy as np

## Serijos

In [17]:
labels = ['W', 'X', 'Y', 'Z']
data = [10, 20, 30, 25]
pandos_serija = pd.Series(data=data)
pandos_serija

0    10
1    20
2    30
3    25
dtype: int64

In [18]:
suvardinta_serija = pd.Series(data=data, index=labels)
suvardinta_serija

W    10
X    20
Y    30
Z    25
dtype: int64

In [19]:
asmuo = {
    'vardas': 'daiva',
    'pavarde': 'reinike',
    'amzius': 35,
    'pareigos': 'studente'
}
asmens_serija = pd.Series(asmuo)
asmens_serija

vardas         daiva
pavarde      reinike
amzius            35
pareigos    studente
dtype: object

In [20]:
miestai_vasara = pd.Series([400, 200, 200, 200, 100], ['Vilnius', 'Kaunas', 'Klaipeda', 'Palanga', 'Kretinga'])
miestai_vasara

Vilnius     400
Kaunas      200
Klaipeda    200
Palanga     200
Kretinga    100
dtype: int64

In [21]:
miestai_ziema = pd.Series([500, 300, 150, 100, 750], ['Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai', 'Panevezys'])
miestai_ziema

Vilnius      500
Kaunas       300
Klaipeda     150
Siauliai     100
Panevezys    750
dtype: int64

In [22]:
miestai_ziema + miestai_vasara

Kaunas       500.0
Klaipeda     350.0
Kretinga       NaN
Palanga        NaN
Panevezys      NaN
Siauliai       NaN
Vilnius      900.0
dtype: float64

## DataFrame

In [23]:
betkas = pd.DataFrame(
    np.random.rand(5, 6),
    ['a', 'b', 'c', 'd', 'e'],
    ['U', 'V', 'W', 'X', 'Y', 'Z']
)
betkas

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [24]:
betkas['U']

a    0.095444
b    0.461033
c    0.401120
d    0.109410
e    0.402905
Name: U, dtype: float64

In [25]:
type(betkas)

pandas.core.frame.DataFrame

In [26]:
type(betkas['U'])

pandas.core.series.Series

In [28]:
# naujas stulpelis
betkas['T-naujas'] = np.random.rand(5)

In [31]:
betkas

          U         V         W         X         Y         Z  T-naujas
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428  0.459656
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313  0.441761
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316  0.488433
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337  0.378272
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117  0.484445

In [30]:
# stulpelio istrynimas, grazina rezultata kaip kopija
betkas.drop('T-naujas', axis=1)

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [32]:
# su inplace vykdo ant originalo
betkas.drop('T-naujas', axis=1, inplace=True)

In [38]:
betkas

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [36]:
a_eilute_is_betko = betkas.loc['a']
a_eilute_is_betko

U    0.095444
V    0.842605
W    0.197930
X    0.597436
Y    0.931078
Z    0.079428
Name: a, dtype: float64

In [37]:
# istrina eilute, norint panaikinti is originalo, reikia nurodyti inplace
betkas.drop('e')

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337

In [39]:
# eilutes indeksas nuo 0
betkas.iloc[4]

U    0.402905
V    0.994407
W    0.739405
X    0.554753
Y    0.898844
Z    0.461117
Name: e, dtype: float64

In [40]:
# gauname konkrecia reiksme
betkas.loc['a', 'Z']

0.07942827702361988

In [41]:
# rezis
betkas.loc[['a', 'c'], ['U', 'X', 'Z']]

          U         X         Z
a  0.095444  0.597436  0.079428
c  0.401120  0.646661  0.675316

In [47]:
betkas.iloc[[2, 4], -2]

c    0.050342
e    0.898844
Name: Y, dtype: float64

In [48]:
betkas.iloc[[x for x in range(1, 4)], [y for y in range(0, 3)]]

          U         V         W
b  0.461033  0.915845  0.622510
c  0.401120  0.745827  0.226633
d  0.109410  0.327664  0.245513

### duomenu traukimas pagal salyga

In [52]:
betkas[betkas > 0.5]

    U         V         W         X         Y         Z
a NaN  0.842605       NaN  0.597436  0.931078       NaN
b NaN  0.915845  0.622510       NaN  0.667111       NaN
c NaN  0.745827       NaN  0.646661       NaN  0.675316
d NaN       NaN       NaN  0.743072  0.899044  0.822337
e NaN  0.994407  0.739405  0.554753  0.898844       NaN

In [53]:
betkas[betkas['W'] > 0.5]

          U         V         W         X         Y         Z
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

### uzklausu kombinavimas

In [54]:
betkas[betkas['W'] > 0.5][['U', 'W', 'Z']]

          U         W         Z
b  0.461033  0.622510  0.318313
e  0.402905  0.739405  0.461117

### salygu kombinavimas

In [57]:
betkas[(betkas['W'] > 0.5) & (betkas['Z'] < 0.5)]

          U         V         W         X         Y         Z
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [58]:
betkas[(betkas['W'] > 0.5) & (betkas['Z'] < 0.5)][['W', 'Z']]

          W         Z
b  0.622510  0.318313
e  0.739405  0.461117

### operacijos su index stulpeliu

In [59]:
betkas.reset_index()

  index         U         V         W         X         Y         Z
0     a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
1     b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
2     c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
3     d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
4     e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [60]:
betkas

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [66]:
naujas_indeksas = 'Vilnius Kaunas Klaipeda Palanga Kretinga'.split()
betkas['Miestas'] = naujas_indeksas
betkas

          U         V         W         X         Y         Z   Miestas
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428   Vilnius
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313    Kaunas
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316  Klaipeda
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337   Palanga
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117  Kretinga

In [67]:
miestu_betkas = betkas.set_index('Miestas')

In [70]:
betkas.drop('Miestas', axis=1, inplace=True)

In [72]:
betkas

          U         V         W         X         Y         Z
a  0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
b  0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
c  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
d  0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
e  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117

In [71]:
miestu_betkas

                 U         V         W         X         Y         Z
Miestas
Vilnius   0.095444  0.842605  0.197930  0.597436  0.931078  0.079428
Kaunas    0.461033  0.915845  0.622510  0.492345  0.667111  0.318313
Klaipeda  0.401120  0.745827  0.226633  0.646661  0.050342  0.675316
Palanga   0.109410  0.327664  0.245513  0.743072  0.899044  0.822337
Kretinga  0.402905  0.994407  0.739405  0.554753  0.898844  0.461117